open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbmsc.c
/*
 * Copyright (c) 2022, sakumisu
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 CherryUSB MSC transport adapted for the NuttX block-driver ABI.
 * The BOT/SCSI state machine is derived from the Beken v3.1.1.9 CherryUSB
 * source.  Storage ownership is deliberately kept in NuttX: this file never
 * initializes or calls the SDK bk_sd_card_* stack.
 */

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_USBMSC

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/fs/fs.h>
#include <nuttx/mutex.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_usbmsc.h>

/* The SDK bundle contains CherryUSB core and its OS adapter, but not the MSC
 * class object.  Build the class state machine here and force block I/O onto
 * its worker so no SDIO operation runs from a USB endpoint callback.
 */

#define CONFIG_USBDEV_MSC_THREAD    1
#define CONFIG_USBDEV_MSC_BLOCK_SIZE CONFIG_BK7258_USBMSC_BUFFER_SIZE
#define CONFIG_USBDEV_MSC_STACKSIZE CONFIG_BK7258_USBMSC_STACKSIZE
#define CONFIG_USBDEV_MSC_PRIO      CONFIG_BK7258_USBMSC_PRIORITY

#include <components/cherryusb/usbd_core.h>
#include <components/cherryusb/usbd_msc.h>
#include <components/cherryusb/usb_scsi.h>
#ifdef CONFIG_USBDEV_MSC_THREAD
#include <components/cherryusb/usb_osal.h>
#endif

#define MSC_THREAD_OP_READ_MEM   1
#define MSC_THREAD_OP_WRITE_MEM  2
#define MSC_THREAD_OP_WRITE_DONE 3
#define MSC_THREAD_OP_RESET      4
#define MSC_THREAD_OP_SUSPEND    5


#define MSD_OUT_EP_IDX 0
#define MSD_IN_EP_IDX  1

/* Describe EndPoints configuration */
static struct usbd_endpoint mass_ep_data[2];

/* MSC Bulk-only Stage */
enum Stage {
    MSC_READ_CBW = 0, /* Command Block Wrapper */
    MSC_DATA_OUT = 1, /* Data Out Phase */
    MSC_DATA_IN = 2,  /* Data In Phase */
    MSC_SEND_CSW = 3, /* Command Status Wrapper */
    MSC_WAIT_CSW = 4, /* Command Status Wrapper */
};

/* Device data structure */
/*USB_NOCACHE_RAM_SECTION*/
struct usbd_msc_cfg_priv {
    /* state of the bulk-only state machine */
    enum Stage stage;
    USB_MEM_ALIGNX struct CBW cbw;
    USB_MEM_ALIGNX struct CSW csw;

    bool readonly;
    uint8_t sKey; /* Sense key */
    uint8_t ASC;  /* Additional Sense Code */
    uint8_t ASQ;  /* Additional Sense Qualifier */
    uint8_t max_lun;
    uint32_t start_sector;
    uint32_t nsectors;
    uint16_t scsi_blk_size;
    uint32_t scsi_blk_nbr;

    uint8_t block_buffer[CONFIG_USBDEV_MSC_BLOCK_SIZE];
} usbd_msc_cfg;

#ifdef CONFIG_USBDEV_MSC_THREAD
static volatile uint8_t thread_op;
static beken_semaphore_t msc_sem;
static usb_osal_thread_t msc_thread = NULL;
static volatile uint32_t current_byte_read;
#endif

static uint32_t s_msc_storage_init;
static struct inode *g_bk7258_usbmsc_inode;
static struct geometry g_bk7258_usbmsc_geometry;
static mutex_t g_bk7258_usbmsc_lock = NXMUTEX_INITIALIZER;

#define MSC_IN_EP  0x81
#define MSC_OUT_EP 0x02

#define USBD_VID           CONFIG_BK7258_USBMSC_VID
#define USBD_PID           CONFIG_BK7258_USBMSC_PID
#define USBD_MAX_POWER     100
#define USBD_LANGID_STRING 1033

#define USB_CONFIG_SIZE (9 + MSC_DESCRIPTOR_LEN)

#ifdef CONFIG_USB_HS
#define MSC_MAX_MPS 512
#else
#define MSC_MAX_MPS 64
#endif

#define UI_SECTORS (64*1024*2) //64M
#define UI_USE_BEGIN_SECTOR 0
//volatile static uint8_t gs_ui_sector_display_enable = 0;
volatile static uint8_t gs_status = 0;
static void usbd_set_status(uint8_t status);

const uint8_t msc_storage_descriptor[] __attribute__((aligned(4))) = {
    /* Keep the control-plane descriptor deliberately small, just like the
     * proven CDC path.  Product identity for a mass-storage disk comes from
     * SCSI INQUIRY; optional USB strings only add EP0 transactions during the
     * sensitive CDC-to-MSC re-enumeration window.
     */
    0x12,                       /* bLength */
    USB_DESCRIPTOR_TYPE_DEVICE, /* bDescriptorType */
    0x00, 0x02,                 /* bcdUSB 2.0 */
    0x00,                       /* bDeviceClass */
    0x00,                       /* bDeviceSubClass */
    0x00,                       /* bDeviceProtocol */
    0x40,                       /* bMaxPacketSize0 */
    USBD_VID & 0xff, (USBD_VID >> 8) & 0xff,
    USBD_PID & 0xff, (USBD_PID >> 8) & 0xff,
    0x00, 0x02,                 /* bcdDevice 2.0 */
    0x00,                       /* iManufacturer */
    0x00,                       /* iProduct */
    0x00,                       /* iSerialNumber */
    0x01,                       /* bNumConfigurations */
    USB_CONFIG_DESCRIPTOR_INIT(USB_CONFIG_SIZE, 0x01, 0x01, USB_CONFIG_BUS_POWERED, USBD_MAX_POWER),
    MSC_DESCRIPTOR_INIT(0x00, MSC_OUT_EP, MSC_IN_EP, 0x00),
    0x00
};

_Static_assert(sizeof(msc_storage_descriptor) == 18u + USB_CONFIG_SIZE + 1u,
               "BK7258 MSC descriptor length mismatch");

static struct usbd_interface gs_intf0;

#define BK7258_MUSB_POWER_REG        0x46000001u
#define BK7258_MUSB_POWER_SOFTCONN   (1u << 6)
#define BK7258_USB_DETACH_US         10000u

static void bk7258_usbmsc_soft_disconnect(void)
{
    volatile uint8_t *power = (volatile uint8_t *)BK7258_MUSB_POWER_REG;

    *power &= (uint8_t)~BK7258_MUSB_POWER_SOFTCONN;
    (void)nxsig_usleep(BK7258_USB_DETACH_US);
}


static void usbd_msc_reset(void)
{
    usbd_msc_cfg.stage = MSC_READ_CBW;
    usbd_msc_cfg.readonly = false;
}

static int msc_storage_class_interface_request_handler(struct usb_setup_packet *setup, uint8_t **data, uint32_t *len)
{
    USB_LOG_VBS("MSC Class request: "
                "bRequest 0x%02x\r\n",
                setup->bRequest);

    switch (setup->bRequest) {
        case MSC_REQUEST_RESET:
            USB_LOG_DBG("MSC_REQUEST_RESET\r\n");
            usbd_msc_reset();
            break;

        case MSC_REQUEST_GET_MAX_LUN:
            *data = (uint8_t *)(&usbd_msc_cfg.max_lun);
            *len = 1;
            break;

        default:
            USB_LOG_DBG("Unhandled MSC Class bRequest 0x%02x\r\n", setup->bRequest);
            return -1;
    }

    return 0;
}

void msc_storage_notify_handler(uint8_t event, void *arg)
{
    switch (event) {
        case USBD_EVENT_ERROR:
            break;
        case USBD_EVENT_RESET:
            USB_LOG_VBS("USBD_EVENT_RESET\r\n");
            usbd_msc_reset();
            break;
        case USBD_EVENT_CONNECTED:
        case USBD_EVENT_DISCONNECTED:
            break;
        case USBD_EVENT_CONFIGURED:
            USB_LOG_VBS("Start reading cbw\r\n");
            usbd_ep_start_read(mass_ep_data[MSD_OUT_EP_IDX].ep_addr, (uint8_t *)&usbd_msc_cfg.cbw, USB_SIZEOF_MSC_CBW);
            break;
        case USBD_EVENT_SUSPEND:
            USB_LOG_VBS("USBD_EVENT_SUSPEND\r\n");
            break;
        case USBD_EVENT_RESUME:

            USB_LOG_VBS("USBD_EVENT_RESUME\r\n");
            break;
        default:
            break;
    }
}

