open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbmsc.c
    usbd_msc_get_cap(0, &usbd_msc_cfg.scsi_blk_nbr, &usbd_msc_cfg.scsi_blk_size);

    if (usbd_msc_cfg.scsi_blk_size > CONFIG_USBDEV_MSC_BLOCK_SIZE) {
        USB_LOG_ERR("msc block buffer overflow\r\n");
        return NULL;
    }
#ifdef CONFIG_USBDEV_MSC_THREAD
    if(msc_thread == NULL)
    {
        if (rtos_init_semaphore(&msc_sem, 1) != BK_OK) {
            USB_LOG_ERR("failed to create msc semaphore\r\n");
            return NULL;
        }
        msc_thread = usb_osal_thread_create("usbd_msc", CONFIG_USBDEV_MSC_STACKSIZE, CONFIG_USBDEV_MSC_PRIO, usbd_msc_thread, NULL);
        if (msc_thread == NULL) {
            USB_LOG_ERR("no enough memory to alloc msc thread\r\n");
            (void)rtos_deinit_semaphore(&msc_sem);
            msc_sem = NULL;
            return NULL;
        }
    }
#endif

    return intf;
}

void usbd_msc_set_readonly(bool readonly)
{
    usbd_msc_cfg.readonly = readonly;
}

int usbd_ms_media_get_status(void)
{
	return gs_status;
}

static void usbd_set_status(uint8_t status)
{
   gs_status = status;
}

void usbd_msc_get_cap(uint8_t lun, uint32_t *block_num, uint16_t *block_size)
{
    (void)lun;

    if (block_num == NULL || block_size == NULL) {
        return;
    }

    if (!s_msc_storage_init || g_bk7258_usbmsc_inode == NULL) {
        *block_num = 0;
        *block_size = 0;
        return;
    }

    *block_num = (uint32_t)g_bk7258_usbmsc_geometry.geo_nsectors;
    *block_size = (uint16_t)g_bk7258_usbmsc_geometry.geo_sectorsize;
}

int usbd_msc_sector_read(uint32_t sector, uint8_t *buffer, uint32_t length)
{
    struct inode *inode;
    uint32_t sectorsize;
    size_t nsectors;
    ssize_t nread;
    int ret;

    sectorsize = g_bk7258_usbmsc_geometry.geo_sectorsize;
    if (buffer == NULL || sectorsize == 0 || length == 0 ||
        (length % sectorsize) != 0) {
        return -EINVAL;
    }

    nsectors = length / sectorsize;
    if (sector >= g_bk7258_usbmsc_geometry.geo_nsectors ||
        nsectors > g_bk7258_usbmsc_geometry.geo_nsectors - sector) {
        return -ERANGE;
    }

    ret = nxmutex_lock(&g_bk7258_usbmsc_lock);
    if (ret < 0) {
        return ret;
    }

    inode = g_bk7258_usbmsc_inode;
    if (!s_msc_storage_init || inode == NULL || inode->u.i_bops == NULL ||
        inode->u.i_bops->read == NULL) {
        nxmutex_unlock(&g_bk7258_usbmsc_lock);
        return -ENODEV;
    }

    nread = inode->u.i_bops->read(inode, buffer, sector, nsectors);
    nxmutex_unlock(&g_bk7258_usbmsc_lock);
    return nread == (ssize_t)nsectors ? OK :
           (nread < 0 ? (int)nread : -EIO);
}

int usbd_msc_sector_write(uint32_t sector, uint8_t *buffer, uint32_t length)
{
    struct inode *inode;
    uint32_t sectorsize;
    size_t nsectors;
    ssize_t nwritten;
    int ret;

    sectorsize = g_bk7258_usbmsc_geometry.geo_sectorsize;
    if (buffer == NULL || sectorsize == 0 || length == 0 ||
        (length % sectorsize) != 0) {
        return -EINVAL;
    }

    nsectors = length / sectorsize;
    if (sector >= g_bk7258_usbmsc_geometry.geo_nsectors ||
        nsectors > g_bk7258_usbmsc_geometry.geo_nsectors - sector) {
        return -ERANGE;
    }

    ret = nxmutex_lock(&g_bk7258_usbmsc_lock);
    if (ret < 0) {
        return ret;
    }

    inode = g_bk7258_usbmsc_inode;
    if (!s_msc_storage_init || inode == NULL || inode->u.i_bops == NULL ||
        inode->u.i_bops->write == NULL) {
        nxmutex_unlock(&g_bk7258_usbmsc_lock);
        return -ENODEV;
    }

    nwritten = inode->u.i_bops->write(inode, buffer, sector, nsectors);
    nxmutex_unlock(&g_bk7258_usbmsc_lock);
    return nwritten == (ssize_t)nsectors ? OK :
           (nwritten < 0 ? (int)nwritten : -EIO);
}

int bk7258_usbmsc_initialize(const char *blockdev)
{
    struct usbd_interface *intf;
    struct inode *inode = NULL;
    struct geometry geometry;
    int ret;

    if (blockdev == NULL || blockdev[0] == '\0') {
        return -EINVAL;
    }

    ret = nxmutex_lock(&g_bk7258_usbmsc_lock);
    if (ret < 0) {
        syslog(LOG_ERR, "BK7258 USBMSC START stage=lock-fail ret=%d\n",
               ret);
        return ret;
    }


    if (s_msc_storage_init) {
        nxmutex_unlock(&g_bk7258_usbmsc_lock);
        return -EBUSY;
    }

    ret = open_blockdriver(blockdev, 0, &inode);
    if (ret < 0) {
        syslog(LOG_ERR,
               "BK7258 USBMSC START stage=block-open-fail dev=%s ret=%d\n",
               blockdev, ret);
        nxmutex_unlock(&g_bk7258_usbmsc_lock);
        return ret;
    }


    if (inode == NULL || inode->u.i_bops == NULL ||
        inode->u.i_bops->geometry == NULL ||
        inode->u.i_bops->read == NULL || inode->u.i_bops->write == NULL) {
        ret = -ENODEV;
        goto errout_with_inode;
    }

    ret = inode->u.i_bops->geometry(inode, &geometry);
    if (ret < 0 || !geometry.geo_available || geometry.geo_nsectors == 0 ||
        geometry.geo_sectorsize == 0 ||
        geometry.geo_sectorsize > CONFIG_USBDEV_MSC_BLOCK_SIZE ||
        (CONFIG_USBDEV_MSC_BLOCK_SIZE % geometry.geo_sectorsize) != 0 ||
        geometry.geo_nsectors > UINT32_MAX ||
        geometry.geo_sectorsize > UINT16_MAX) {
        ret = ret < 0 ? ret : -ENODEV;
        syslog(LOG_ERR,
               "BK7258 USBMSC START stage=geometry-fail ret=%d "
               "available=%u sectors=%lu size=%u\n",
               ret, geometry.geo_available ? 1u : 0u,
               (unsigned long)geometry.geo_nsectors,
               (unsigned int)geometry.geo_sectorsize);
        goto errout_with_inode;
    }


    g_bk7258_usbmsc_inode = inode;
    memcpy(&g_bk7258_usbmsc_geometry, &geometry, sizeof(geometry));
    s_msc_storage_init = 1;

    memset(&gs_intf0, 0, sizeof(gs_intf0));
    memset(mass_ep_data, 0, sizeof(mass_ep_data));
    usbd_desc_register(msc_storage_descriptor);
    intf = usbd_msc_init_intf(&gs_intf0, MSC_OUT_EP, MSC_IN_EP);
    if (intf == NULL) {
        ret = -ENOMEM;
        syslog(LOG_ERR,
               "BK7258 USBMSC START stage=class-fail ret=%d\n", ret);
        goto errout_with_state;
    }

    usbd_add_interface(intf);
    ret = usbd_initialize();
    if (ret < 0) {
        syslog(LOG_ERR,
               "BK7258 USBMSC START stage=controller-fail ret=%d\n", ret);
        goto errout_with_state;
    }


    syslog(LOG_INFO,
           "BK7258 USBMSC: ready blockdev=%s sectors=%lu size=%u\n",
           blockdev, (unsigned long)geometry.geo_nsectors,
           (unsigned int)geometry.geo_sectorsize);
    nxmutex_unlock(&g_bk7258_usbmsc_lock);
    return OK;

errout_with_state:
    s_msc_storage_init = 0;
    g_bk7258_usbmsc_inode = NULL;
    memset(&g_bk7258_usbmsc_geometry, 0,
           sizeof(g_bk7258_usbmsc_geometry));
    (void)usbd_deinitialize();
errout_with_inode:
    (void)close_blockdriver(inode);
    nxmutex_unlock(&g_bk7258_usbmsc_lock);
    return ret;
}

int bk7258_usbmsc_uninitialize(void)
{
    struct inode *inode;
    int close_ret;
    int ret;

    ret = nxmutex_lock(&g_bk7258_usbmsc_lock);
    if (ret < 0) {
        return ret;
    }

    if (!s_msc_storage_init || g_bk7258_usbmsc_inode == NULL) {
        nxmutex_unlock(&g_bk7258_usbmsc_lock);
        return -ENODEV;
    }

    s_msc_storage_init = 0;
    bk7258_usbmsc_soft_disconnect();
    ret = usbd_deinitialize();
    inode = g_bk7258_usbmsc_inode;
    g_bk7258_usbmsc_inode = NULL;
    memset(&g_bk7258_usbmsc_geometry, 0,
           sizeof(g_bk7258_usbmsc_geometry));
    usbd_set_status(0);
    close_ret = close_blockdriver(inode);

    nxmutex_unlock(&g_bk7258_usbmsc_lock);
    return ret < 0 ? ret : close_ret;
}

#endif /* CONFIG_BK7258_USBMSC */
